# Домашнее задание к занятию "Best practicies современной киберзащиты АСУ ТП"

### Цель задания

В результате выполнения этого задания вы на практике попробуете разобраться с требованиями к исходному коду программ.
Безопасная разработка - одно из обязательных требований нашего времени. Код, разработанный программистом, должен быть как надежен и точен с точки зрения  реализуемой функции, так и устойчив к кибератакам при эксплуатации.

В результате выполнения задания вы:

1. Примените Top 20 Secure PLC Coding Practices на учебной программе

------

### Инструкция к заданию

1. Сделайте копию [Шаблона для домашнего задания](https://docs.google.com/document/d/1JpEXp6bRgmOtNbMosYwIjgBwqzbtQoAxsIaS1M1V9r0/edit) себе на Google Disk.
1. В названии файла введите корректное название лекции и вашу фамилию и имя.
1. Зайдите в «Настройки доступа» и выберите доступ «Просматривать могут все в Интернете, у кого есть ссылка». Ссылка на инструкцию [Как предоставить доступ к файлам и папкам на Google Диске](https://support.google.com/docs/answer/2494822?hl=ru&co=GENIE.Platform%3DDesktop)
1. Скопируйте текст задания в свой документ.
1. Выполните домашнее задание, запишите ответы.
1. Для проверки домашнего задания преподавателем отправьте ссылку на ваш документ в личном кабинете.
1. Любые вопросы по решению задач задавайте в чате учебной группы.

------

### Инструменты/ дополнительные материалы, которые пригодятся для выполнения задания

1. Копия [Шаблона для домашнего задания](https://docs.google.com/document/d/1JpEXp6bRgmOtNbMosYwIjgBwqzbtQoAxsIaS1M1V9r0/edit)

   

### Задание 1.

Несколько дней назад вы поставили задачу стажеру написать программу, которая инициализирует насосы уровнем мощности, который вручную задает оператор. В итоге был предоставлен следующий код:

`

    #include <stdio.h>
    
    int pumps[5];
    
    int main()
    {
        for(int i=0; i<5; i++)
        {
          int number;
          int lvl;
      
          printf("Enter pump: ");
          scanf("%i", &number);
          printf("Select pump number: %i\n", number);
          
          if(number > 5)
          {
            printf("Wrong pump number!!!");
          }
      
          printf("Enter level in %: ");
          scanf("%i", &lvl);
          printf("Level = %i\n", lvl);
          
          pumps[number] = lvl;
        }
      
        return 0;
    }

`

Какие уязвимости и ошибки вы смогли найти? На что они будут влиять и как их исправить? 



*Приведите ответ в свободной форме* 

------

### Критерии оценки

Зачёт:

- Предоставлено описание хотя бы двух ошибок и указаны методы их исправления.


На доработку:

- Задание выполнено частично или не выполнено.
