# Домашнее задание к занятию «Best practicies современной кибербезопасности АСУ ТП»

### Цель задания

Безопасная разработка - одно из обязательных требований нашего времени. Код, разработанный программистом, должен быть как надёжен и точен с точки зрения  реализуемой функции, так и устойчив к кибератакам при эксплуатации.

В результате выполнения задания вы сможете:

1. Попробовать на практике разобраться с требованиями к исходному коду программ
1. Применить Top 20 Secure PLC Coding Practices на учебной программе

------

### Инструкция к заданию

1. Скачайте [Шаблон для домашнего задания](https://u.netology.ru/backend/uploads/lms/content_assets/file/4449/%D0%A8%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD_%D0%B4%D0%BB%D1%8F_%D0%B4%D0%BE%D0%BC%D0%B0%D1%88%D0%BD%D0%B5%D0%B3%D0%BE_%D0%B7%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D1%8F__Best_practicies_%D1%81%D0%BE%D0%B2%D1%80%D0%B5%D0%BC%D0%B5%D0%BD%D0%BD%D0%BE%D0%B9_%D0%BA%D0%B8%D0%B1%D0%B5%D1%80%D0%B7%D0%B0%D1%89%D0%B8%D1%82%D1%8B_%D0%90%D0%A1%D0%A3_%D0%A2%D0%9F__-_%D0%A4%D0%B0%D0%BC%D0%B8%D0%BB%D0%B8%D1%8F_%D0%98%D0%BC%D1%8F__%D0%A1%D0%94%D0%95%D0%9B%D0%90%D0%99%D0%A2%D0%95_%D0%9A%D0%9E%D0%9F%D0%98%D0%AE_.docx) на своё устройство.
2. Откройте скачанный файл на личном диске в Google.
3. В названии файла введите корректное название лекции и ваши фамилию и имя.
4. Зайдите в «Настройки доступа» и выберите доступ «Просматривать могут все в интернете, у кого есть ссылка». Инструкция «Как предоставить доступ к файлам и папкам на Google Диске» [по ссылке](https://support.google.com/docs/answer/2494822?hl=ru&co=GENIE.Platform%3DDesktop).
5. Скопируйте текст задания в свой документ.
6. Выполните задание, запишите ответы и приложите необходимые скриншоты в свой Google-документ.
7. Для проверки домашнего задания отправьте ссылку на ваш Google-документ в личном кабинете.
8. Любые вопросы по решению задач можно задать в чате учебной группы, в чате поддержки или в разделе «Вопросы по заданию» в личном кабинете.
9. Подробнее о работе с Google-документами и загрузке решения на проверку можно найти в [«Руководстве по работе с материалами для обучения»](https://l.netology.ru/instruktsiya-po-materialami-dlya-obucheniya)


------

### Инструменты/ дополнительные материалы, которые пригодятся для выполнения задания

[Шаблон для домашнего задания](https://u.netology.ru/backend/uploads/lms/content_assets/file/4449/%D0%A8%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD_%D0%B4%D0%BB%D1%8F_%D0%B4%D0%BE%D0%BC%D0%B0%D1%88%D0%BD%D0%B5%D0%B3%D0%BE_%D0%B7%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D1%8F__Best_practicies_%D1%81%D0%BE%D0%B2%D1%80%D0%B5%D0%BC%D0%B5%D0%BD%D0%BD%D0%BE%D0%B9_%D0%BA%D0%B8%D0%B1%D0%B5%D1%80%D0%B7%D0%B0%D1%89%D0%B8%D1%82%D1%8B_%D0%90%D0%A1%D0%A3_%D0%A2%D0%9F__-_%D0%A4%D0%B0%D0%BC%D0%B8%D0%BB%D0%B8%D1%8F_%D0%98%D0%BC%D1%8F__%D0%A1%D0%94%D0%95%D0%9B%D0%90%D0%99%D0%A2%D0%95_%D0%9A%D0%9E%D0%9F%D0%98%D0%AE_.docx)

-----

### Задание 1.

Несколько дней назад вы поставили задачу стажёру написать программу, которая инициализирует насосы уровнем мощности, задаваемой оператором. В итоге был предоставлен следующий код:


    #include <stdio.h>
    
    int pumps[5];
    
    int main()
    {
        for(int i=0; i<5; i++)
        {
          int number;
          int lvl;
      
          printf("Enter pump: ");
          scanf("%i", &number);
          printf("Select pump number: %i\n", number);
          
          if(number > 5)
          {
            printf("Wrong pump number!!!");
          }
      
          printf("Enter level in %: ");
          scanf("%i", &lvl);
          printf("Level = %i\n", lvl);
          
          pumps[number] = lvl;
        }
      
        return 0;
    }
    

Какие уязвимости и ошибки вы смогли найти? На что они будут влиять и как их исправить? 



*Приведите ответ в свободной форме* 

------


### Правила приёма работы

1. Отправлена ссылка на документ (Google Doc) с выполненным заданием в личном кабинете.
2. Документ размещён на личном Google Диске.
3. К документу настроены права доступа «Просматривать могут все в Интернете, у кого есть ссылка».

------

### Критерии оценки

Зачёт:

- Предоставлено описание не менее двух ошибок и указаны методы их исправления.


На доработку:

- Описано менее двух ошибок, не указаны методы из исправления или задание не выполнено.
