# Домашнее задание к занятию «Best practicies современной киберзащиты АСУ ТП»

### Цель задания

Безопасная разработка - одно из обязательных требований нашего времени. Код, разработанный программистом, должен быть как надёжен и точен с точки зрения  реализуемой функции, так и устойчив к кибератакам при эксплуатации.

В результате выполнения задания вы сможете:

1. Попробовать на практике разобраться с требованиями к исходному коду программ
1. Применить Top 20 Secure PLC Coding Practices на учебной программе

------

### Инструкция к заданию

1. Сделайте копию [Шаблона для домашнего задания](https://docs.google.com/document/d/1RcGhwr1aS2CJ68rDB-jNAVYntSDy0Nb7nJ5jwVdLaEs/edit?usp=sharing) себе на Google Диск.
1. В названии файла введите корректное название лекции и вашу фамилию и имя.
1. Зайдите в «Настройки доступа» и выберите доступ «Просматривать могут все в Интернете, у кого есть ссылка». Ссылка на инструкцию [Как предоставить доступ к файлам и папкам на Google Диске](https://support.google.com/docs/answer/2494822?hl=ru&co=GENIE.Platform%3DDesktop)
1. Скопируйте текст задания в свой документ.
1. Выполните домашнее задание, запишите ответы.
1. Для проверки домашнего задания преподавателем отправьте ссылку на ваш документ в личном кабинете.
1. Любые вопросы по решению задач задавайте в чате учебной группы.

------

### Инструменты/ дополнительные материалы, которые пригодятся для выполнения задания

[Шаблон для домашнего задания](https://docs.google.com/document/d/1RcGhwr1aS2CJ68rDB-jNAVYntSDy0Nb7nJ5jwVdLaEs/edit?usp=sharing)

-----

### Задание 1.

Несколько дней назад вы поставили задачу стажёру написать программу, которая инициализирует насосы уровнем мощности, задаваемой оператором. В итоге был предоставлен следующий код:

`

    #include <stdio.h>
    
    int pumps[5];
    
    int main()
    {
        for(int i=0; i<5; i++)
        {
          int number;
          int lvl;
      
          printf("Enter pump: ");
          scanf("%i", &number);
          printf("Select pump number: %i\n", number);
          
          if(number > 5)
          {
            printf("Wrong pump number!!!");
          }
      
          printf("Enter level in %: ");
          scanf("%i", &lvl);
          printf("Level = %i\n", lvl);
          
          pumps[number] = lvl;
        }
      
        return 0;
    }

`

Какие уязвимости и ошибки вы смогли найти? На что они будут влиять и как их исправить? 



*Приведите ответ в свободной форме* 

------


### Правила приёма работы

1. Отправлена ссылка на документ (Google Doc) с выполненным заданием в личном кабинете.
2. Документ размещён на личном Google Диске.
3. К документу настроены права доступа «Просматривать могут все в Интернете, у кого есть ссылка».

------

### Критерии оценки

Зачёт:

- Предоставлено описание не менее двух ошибок и указаны методы их исправления.


На доработку:

- Описано менее двух ошибок, не указаны методы из исправления или задание не выполнено.
